       01   wf-FrameOptions.
            03 wf-Frame_Furemu                            pic 9(02).
               88 wf-Frame_Furemu-Return_Modoru                    value 99.
            03 wf-Option_Opushon                            pic 9(02).
               88 wf-Option_Opushon-Return_Modoru                    value 99.        
       
      


