       fd   pd00400.
       
       01   f00400-City_Shichoson.
            03 f00400-CompanyCode                   pic 9(03).
            03 f00400-BranchCode                    pic 9(04).
            03 f00400-CityID                 pic 9(09).
            03 f00400-CityCode                 pic 9(07).
            03 f00400-Name_Namae-City_Shichoson               pic x(55).
            03 f00400-StateID                    pic 9(09). 
       
      


