       fd   pd00200.
       
       01   f00200-Country_Kuni.
            03 f00200-CompanyCode                   pic 9(03).
            03 f00200-BranchCode                    pic 9(04).
            03 f00200-CountryID                      pic 9(09).
            03 f00200-CountryCode                      pic 9(04).
            03 f00200-CountryName                    pic x(55).
       
      


