       fd   pd01200.
       
       01   f01200-User_Yuuzaa-Profile_Purofiru.
            03 f01200-CompanyCode                   pic 9(03).
            03 f01200-BranchCode                    pic 9(04).
            03 f01200-UserID                   pic 9(11).
            03 f01200-ProfileCode                    pic 9(03).
            
