       
       fd   pd02200.

       01   f02200-Parameters-nfe.
            03 f02200-CompanyCode                   pic 9(03).
            03 f02200-BranchCode                    pic 9(04).
            03 f02200-Number-documento             pic 9(09).
            03 f02200-Series-documento              pic 9(03).
