          fd   pd06000.
       
       01   f06000-Stock_Zaiko.
            03 f06000-CompanyCode                   pic 9(03).
            03 f06000-BranchCode                    pic 9(04).
            03 f06000-ProductCode                   pic 9(09).
            03 f06000-qtde-disponivel              pic s9(09)v9(04).
            03 f06000-qtde-reservada               pic s9(09)v9(04).      


