       fd   pd00000.
       
       01   f00000-programas.
            03 f00000-ProgramCode                  pic x(08).
            03 f00000-ProgramDesc           pic x(55).             
            
           
      


