       fd   pd01000.
       
       01   f01000-Profile_Purofiru.
            03 f01000-CompanyCode                   pic 9(03).
            03 f01000-BranchCode                    pic 9(04).
            03 f01000-ProfileCode                    pic 9(03).
            03 f01000-Desc-Profile_Purofiru             pic x(55).