       fd   pd00500.
       
       01   f00500-District_Chiku.
            03 f00500-CompanyCode                   pic 9(03).
            03 f00500-BranchCode                    pic 9(04).
            03 f00500-id-District_Chiku                    pic 9(09).
            03 f00500-DistrictCode                    pic 9(10).
            03 f00500-Name_Namae-District_Chiku                  pic x(55).
            03 f00500-CityID                 pic 9(09).
      


