       fd   pd00900.
       
       01   f00900-User_Yuuzaa-Company_Kaisha.
            03 f00900-UserID                   pic 9(11).
            03 f00900-CompanyCode                   pic 9(03).
            03 f00900-BranchCode                    pic 9(04).     


