       fd   pd00600.
       
       01   f00600-Street_Jusho.
            03 f00600-CompanyCode                   pic 9(03).
            03 f00600-BranchCode                    pic 9(04).
            03 f00600-id-Street_Jusho                pic 9(09).
            03 f00600-ZipCode_Yubin                          pic 9(08).
            03 f00600-Name_Namae-Street_Jusho              pic x(55).
            03 f00600-id-District_Chiku                    pic 9(09).


